---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Structure.StructuralConnectionType
source: html/5606207a-b407-d003-3d74-780d42658c59.htm
---
# StructuralConnectionType Members

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.